src/cf/Catalogs/НастройкиИнтеграцииМаркетплейс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>НастройкиИнтеграцииМаркетплейс</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМаркетплейса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМаркетплейсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ВидыМаркетплейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыМаркетплейсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Wildberries</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OZON</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексМаркет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентомНаЗакупку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионеромНаЗакупку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СФакторинговойКомпанией</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СТранспортнойКомпанией</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/НастройкиИнтеграцииМаркетплейс/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ДанныеЗаполнения = Неопределено Тогда
		ДанныеЗаполнения = Новый Структура;
	КонецЕсли;
	
	Если НЕ ДанныеЗаполнения.Свойство("Владелец") Тогда
		Владелец = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	Иначе
		Владелец = ДанныеЗаполнения.Владелец;
	КонецЕсли;
	
	Если НЕ ДанныеЗаполнения.Свойство("ВидМаркетплейса") Тогда
		ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.WILDBERRIES;
	Иначе
		ВидМаркетплейса = ДанныеЗаполнения.ВидМаркетплейса;
	КонецЕсли;
	
	Если НЕ ДанныеЗаполнения.Свойство("Контрагент") Тогда
		Контрагент = ОбменСМаркетплейс.КонтрагентМаркетплейсаПоУмолчанию(ВидМаркетплейса);
	КонецЕсли;
	
	Если НЕ ДанныеЗаполнения.Свойство("ДоговорКонтрагента") Тогда
		РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ДоговорКонтрагента, Контрагент, Владелец,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером));
	КонецЕсли;
	
	Наименование = ВидМаркетплейса;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
